<template>
  <div class="ServicePact">
    <x-header class="x-header" :left-options="{backText: ''}">《舍豆用户服务协议》</x-header>
    <div class="content-box">
      <div>
        &nbsp;&nbsp;尊敬的用户，欢迎您使用舍豆APP！在使用舍豆的任何服务前，请您必须阅读、理解并接受以下条款。当您决定创建一个舍豆账户时表示您已阅读和接受以下条款。如果您不能完全同意本文件中的条件，则请务必不要使用我们的产品和服务。
      </div>
      <section>
        <h1>一、协议提示</h1>
        <p>1．本协议由舍豆APP（以下简称舍豆）与使用本产品服务的用户（以下简称“您”）所订立的协议。如您对协议有任何疑问，应向舍豆客服咨询。但无论您事实上是否在使用舍豆服务之前认真阅读了本协议内容，只要您使用舍豆服务，则本协议即对您产生约束，届时您不应以未阅读本协议的内容或者未获得舍豆对您问询的解答等理由，主张本协议无效，或要求撤销本协议。</p>
        <p>2．您承诺遵守本协议的约定。</p>
        <p>3．如果你输出的图文并且图文中带有平台上及其他用户上传的图片素材资源即符合使用一次性使用协议，在一次性使用协议下，你便默认同意遵守一次使用协议的相关规定。如果您未遵守相关条款，可能会导致法律诉讼或终止您的账号。</p>
        <p>4．舍豆有权根据需要不时地制订、修改本协议，并以网站公示的方式进行公告，不再单独通知您。变更后的协议和规则一经在网站公布后，立即自动生效。如您不同意相关变更，可以停止使用舍豆服务。您继续使用舍豆服务，即表示您接受经修订的协议和规则。</p>
      </section>
      <section>
        <h1>二、 注册和账户</h1>
        <p>1．您确认，在您完成注册程序时，您应当是具备完全民事权利能力和完全民事行为能力的自然人、法人或其他组织。若您不具备前述主体资格，则您及您的监护人应承担因此而导致的一切后果，且舍豆有权注销（永久冻结）您的账户，并向您及您的监护人索偿。</p>
        <p>2．在您同意本协议，完成注册程序后，舍豆将向您提供一个账户。您的账户仅授权给一个自然人使用。您保证您的账户资料是真实、准确和完整的，并及时更新您的资料。如有合理理由怀疑您提供的资料错误、不实、过时或不完整的，舍豆有权向您发出询问或要求改正的通知，并有权直接做出删除相应资料的处理，直至中止、终止对您提供部分或全部舍豆服务。舍豆对此不承担任何责任，您将承担因此产生的任何直接或间接支出。</p>
        <p>3．当您完成注册程序后会拥有自己的账户号码及密码，您需同意舍豆进入您的账户并获得授权的部分。您有责任妥善保管您的账户号码及/或密码(如适用)，您不得发布您的账户资料，或允许他人使用有关的账户资料进入本网站。您同意采取合理措施以防止他人获取您的账户资料，并向舍豆报告任何未经授权的使用，或通知舍豆更新或删除您任何雇员或代理人的使用权。如果您怀疑自己的用户资料被盗用，请立即与我们联系。在获得或未获得您允许的情况下，或在舍豆收到由您发出的未经授权使用通知之前，任何人使用您的账户，并下载图像内容，您有责任全数支付有关费用。不管这些使用是否确实获得您的授权，您确认并同意承担所有因为您的账户被使用而导致的任何损失或后果。此外，您确认并同意对您每一次登录，以及使用或浏览图像内容的过程负责。舍豆有权接受您的用户资料及密码作为您浏览及使用舍豆内容的最终凭证。</p>
        <p>4．舍豆将根据您提供的个人邮箱，不定期发送服务相关的通知或其他消息，如法律规定的任何通知、服务特点的更改、特殊的价格更改等，以通过邮件形式代替交流。</p>
        <p>5 . 根据2017年6月1日正式实施的《中华人民共和国网络安全法》有关规定，您的账号必须经过实名认证(认证形式包括但不限于绑定手机,提交手持身份证照片)，才可以使用下载、购买VIP会员等服务。</p>
        <p>6 . 一个手机号仅可绑定一个舍豆账号，且该手机号仅可解绑一次；一个账号一年仅可解绑一次手机号。</p>
      </section>
      <section>
        <h1>三、服务条例</h1>
        <h3>&nbsp;（一）基本服务</h3>
        <p>&nbsp;&nbsp;&nbsp;&nbsp;舍豆以任何形式提供的图像、语音、视频及相关资料内容，包括相关的摄影照片、矢量图形、字体、文本、图片说明，或资料信息(以下合称“内容”)，其所有权属于舍豆或其贡献者，并且受中国及国际版权法以及其它知识产权法律法规所保护。 舍豆作为网络服务提供者，对非法转载，盗版行为的发生不具备充分的监控能力。但是当版权拥有者提出侵权指控并出示充分的版权证明材料时，请及时联系我们，我们将尽快处理。</p>
        <h3>&nbsp;（二）一次性使用协议条款</h3>
        <p>&nbsp;&nbsp;&nbsp;&nbsp;  受条款和本协议的规定，我们授予您永久的、非独家的、不可转让的全球一次性使用协议来使用图片素材在你的一个舍豆图文中。除了协议中明确指出使用范围，其余您将不可以使用。所有图片素材的其他权利，包括但不限于版权、其他知识产权，由舍豆和贡献者保留视情况而定。(以下合称“内容”)，其所有权属于舍豆或其贡献者，并且受中国及国际版权法以及其它知识产权法律法规所保护。 舍豆作为网络服务提供者，对非法转载，盗版行为的发生不具备充分的监控能力。但是当版权拥有者提出侵权指控并出示充分的版权证明材料时，请及时联系我们，我们将尽快处理。</p>
        <h3>&nbsp;（三）服务声明</h3>
        <p>1．你可以使用舍豆上符合一次性使用许可协议的素材资源，并正确使用于适用渠道，使用时请确保您已仔细阅读舍豆《免责声明》。</p>
        <h4>2．你理解并且同意舍豆为了谨慎起见而所做的行为：</h4>
        <p>1) 我们将监视你的任何一个输出路径、上传到舍豆的文件或服务，会经常对违反本协议的行为进行处理。</p>
        <p>2) 会无限期的保留你输出的设计细节。</p>
        <p>3) 会追踪任何滥用你用户名和密码或违反本协议的行为或用户。因此请保存好你的用户名和密码，任何人使用您的账户，并下载素材，您都有责任全数支付有关费用。</p>
        <p>4) 暂停或终止您的账户，不另行通知您。如果发现或舍豆有证据认为您有本协议或是任何滥用你的用户名和密码的行为，我们将终止您的账号，并没收所有已得的付费。</p>
        <p>3．您使用本网站及其任何内容时应遵守所有适用的法律。舍豆保留全部酌情权利，可于任何时间，以任何理由，在通知或没有通知您的情况下，撤销您浏览、下载以及使用本网站内容和信息的权利。在接到舍豆的通知后，您同意立即停止有关的使用。舍豆还可以基于任何理由，对本网站的内容进行限制或删除处理。您同意在接到舍豆的通知后，立即停止有关内容的使用。
如果您使用了未经授权的内容，已触犯《中华人民共和国著作权法》及其他相关法律法规，舍豆将会依据《中华人民共和国著作权法》及其他相关法律法规，行使所有的权利及方法去追讨损失，包括向非法使用内容的人士，以及使用内容的受益者追讨金钱上的赔偿。舍豆会根据此协议、图片使用许可协议的相关条款及有关法律法规，向未经授权者追讨费用、损失及赔偿。除此之外，舍豆还会保留一切权利，向未经授权使用者收取(而未经授权使用者必须在此同意支付)十（10）倍版权费。 再者，舍豆或其贡献者有权就非法使用、违反本协议或图片使用许可协议条款向未经授权使用者采取其它法律或索偿行动。更多版权声明请参见《舍豆版权申明》。
</p>
        <p>4．我们尽力确保所提供信息的准确性，然而本网站可能存在技术上或其它方面的错误，以及内容不准确或文字编印上的错误。您应该了解，您的搜索结果可能会包含一些不适当的内容或令人不快的文字。</p>
        <p>5．您应全权负责决定您所使用的内容是否需要取得第三方使用授权，或是否需要获取额外的授权。您不应该只依靠舍豆所提供的资料。如果您并不清楚有关内容是否需要额外的第三方使用授权，您有责任咨询知识产权管理专家或法律顾问的专业意见。</p>
        <h3>（四）禁止用途</h3>
        <h4>以下是协议禁止使用部分。</h4>
        <p>1) 网上图片数据库的检索服务，如复制、转载图片素材或舍豆的设计</p>
        <p>2) 安装和使用图片媒体在多个位置或发布设计的副本在网络服务器或Web服务器，以供其他用户使用 </p>
        <p>3) 包括图片素材的所有模板，网页模板，社交网站、文档、项目或其他方式分配或销售给第三方</p>
        <p>4) 使用于相关设计模板转售的应用程序，无论在线与否，包括但不限于网站模板，名片模板、电子贺卡模板和宣传册设计模板。</p>
        <p>5) 分发许可，转售，出租，出借，转让，赠予或以其他方式转让或分销图片媒体或根据本一次性使用协议授予的权利;</p>
        <p>6) 使用无授权素材为商标，设计标志，商品名称，企业名称，服务标志或logo的一部分;</p>
        <p>7) 删除版权，商标或其他所有权从任何地方嵌入图片素材资源或舍豆的设计</p>
        <p>8) 使用图片素材通过舍豆制作色情，淫秽，不道德，侵犯，诽谤或中伤性的图片，或者很可能给他人带来人身或财产上的损失。</p>
      </section>
      <section>
        <h1>四、有偿服务</h1>
        <p>1．基于舍豆提供会员收费服务，因此如果您选择使用本服务的收费项目，表明您同意本服务可能会随时更改收费价格。对于增加新的服务，舍豆可能会额外收费，或者在其决定的时间改变现有服务的收费。</p>
        <p>2．您可以随时注销您的舍豆账户；然而，没有注销退款。在舍豆暂停或终止你的账户或此协议的情况下，您理解并且同意你不会收到退款或换取任何补偿，任何订阅的未使用时间，任何关于本服务的许可或订阅费用，任何你账户的关联素材内容和数据，以及其他。</p>
        <p>3．您在购买舍豆相关服务时，您同意用支付宝、网银支付方式支付所购买的相关服务，交易或其他金融交易活动中所产生的费用，需您自身承担。</p>
      </section>
      <section>
        <h1>五、免责声明</h1>
        <p>1.  舍豆可能因程序BUG、系统故障、版本更新缺陷、第三方病毒攻击或其他任何因素导致您的VIP账户使用异常、数据发生异常等情形时，您认可此情况为不可抗力所致的特殊免责情况。在数据异常的原因未得到查明前，舍豆有权暂时冻结该异常账号；若查明数据异常为非正常使用行为或前述不可抗力行为所致，舍豆有权恢复您的账号数据/会员账号状态至异常发生前的原始状态（包括向第三方追回被转移数据），且舍豆无须向您承担任何责任。 </p>
        <p>2. 舍豆会努力纠正归类，关键词，说明文字，和命名图片素材资源，但不能保证这些信息的准确性，也同样不能保证所提供的元数据的准确性。舍豆的提供图片均通过合法渠道获得，且经过人工审核，但难免会有少量错漏，如果造成的侵权等问题，请及时联系我们纠正，删除侵权内容。</p>
      </section>
      <section>
        <h1>六、关于隐私</h1>
        <p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;您理解通过使用这项服务，舍豆将会收集，使用，和适度披露您的个人身份信息及使用数据等。</p>
      </section>
      <section>
        <h1>七、赔偿</h1>
        <h4>任何源于或关于：</h4>
        <p>1) 您违反本协议的任何条款、细则或限制；</p>
        <p>2) 在未获得舍豆授权及准许下您使用或修改本网站的任何内容，或把本网站任何内容连结到其它文本或内容；</p>
        <p>3) 您在未获得第三方授权及准许下使用本网站的内容；</p>
        <p>4) 您或您的任何员工、承包商、雇主、代理商、客户、委托人或用户作出不当行为；</p>
        <p>5) 当您因为在社区页面引用本网站内容而引起任何第三方索赔和要求时。
    您同意对舍豆及其内容资源，管理人员、董事、雇员、承包商、子公司、合资企业、授权商和被授权商进行赔偿，并保证其免受任何损害，并承担所有索赔(包括但不限于第三方索赔)，赔偿责任、造成的损失(包括惩罚性损害赔偿)、判决、协议、费用及开支，当中包括合理的法律费用及开支。
</p>
      </section>
      <section>
        <h1>八、协议终止</h1>
        <p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;此协议一直生效，直至舍豆运用最终决定权终止此协议为止。如果您在违反本协议条款的情况下使用或企图使用本网站或其内容，舍豆可能在通知或不通知您的情况下终止本协议。在没有其它足够的法律措施下，除了终止协议外，舍豆保留应有的权利，包括暂时停止或永久终止您的帐户或密码，并对这些行为执行权利解除令。在本协议被终止或限期届满时，本协议中的各条款仍然有效。</p>
      </section>
      <section>
        <h1>九、法律适用、管辖与其他</h1>
        <p>1．本协议之效力、解释、变更、执行与争议解决均适用中华人民共和国法律，如无相关法律规定的，则应参照通用国际商业惯例和（或）行业惯例。</p>
        <p>2．本协议中的标题仅为方便而设，在解释本协议时应被忽略。</p>
        <p>3．如双方就本合同内容或其执行发生任何争议，双方应进行友好协商，并通过书面形式进行约定；协商不成时，任何一方均有权将争议提交中国国际经济贸易仲裁委员会，根据该会届时有效的仲裁程序和规则进行仲裁。仲裁语言为中文。仲裁裁决是终局的,对各方都有约束力。</p>
      </section>
    </div>
  </div>
</template>

<script>
import { XHeader, Tabbar, TabbarItem } from "vux";

export default {
  data() {
    return {};
  },
  components: {
    XHeader,
    Tabbar,
    TabbarItem
  },
  created: function() {}
};
</script>

<style lang="less">
.ServicePact {
  .x-header {
    border-bottom: calc(1 *2 / 7.5 * 1vw) solid rgb(229, 229, 229);
  }
  .content-box {
    padding: 5vw;
  }
}
</style>
